mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
//static void APP_THREAD_CoapRequestHandler(otCoapHeader        * pHeader,
//                                  otMessage           * pMessage,
//                                  const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapLightsSimpleRequestHandler(otCoapHeader        * pHeader,
                                  otMessage           * pMessage,
                                  const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapLightsComplexRequestHandler(otCoapHeader        * pHeader,
                                  otMessage           * pMessage,
                                  const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapToggleLoggingRequestHandler(otCoapHeader        * pHeader,
                                  otMessage           * pMessage,
                                  const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapBorderTimeRequestHandler(otCoapHeader        * pHeader,
                                  otMessage           * pMessage,
                                  const otMessageInfo * pMessageInfo);

void APP_THREAD_GetBorderRouterIP(void);
void updateRTC(time_t now);
void APP_THREAD_SendMyInfo(void);
void APP_THREAD_UpdateBorderRouter(void);
void APP_THREAD_SyncWithBorderRouter(void);
/* USER CODE END PFP */

/* Private variables -----------------------------------------------*/
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint8_t TmpString[C_SIZE_CMD_STRING];
static uint8_t VcpRxBuffer[sizeof(TL_CmdSerial_t)];        /* Received Data over USB are stored in this buffer */
static uint8_t VcpTxBuffer[sizeof(TL_EvtPacket_t) + 254U]; /* Transmit buffer over USB */
#else
#if (CFG_FULL_LOW_POWER == 0)
static uint8_t aRxBuffer[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

#if (CFG_FULL_LOW_POWER == 0)
static uint8_t CommandString[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
static __IO uint16_t indexReceiveChar = 0;
static __IO uint16_t CptReceiveCmdFromUser = 0;

static TL_CmdPacket_t *p_thread_otcmdbuffer;
static TL_EvtPacket_t *p_thread_notif_M0_to_M4;
static __IO uint32_t  CptReceiveMsgFromM0 = 0;
static volatile int FlagReceiveAckFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_TH_Config_t ThreadConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ThreadNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadCliCmdBuffer;

static osThreadId_t OsTaskMsgM0ToM4Id;      /* Task managing the M0 to M4 messaging        */
#if (CFG_FULL_LOW_POWER == 0)
static osThreadId_t OsTaskCliId;            /* Task used to manage CLI comamnd             */
#endif /* (CFG_FULL_LOW_POWER == 0) */

/* USER CODE BEGIN PV */
//static otCoapResource OT_Light_Ressource = {C_LIGHT_RESSOURCE, APP_THREAD_DummyReqHandler, (void*)APP_THREAD_CoapRequestHandler, NULL};

static otCoapResource OT_Lights_Complex_Ressource = {C_LIGHTS_SIMPLE_RESSOURCE, APP_THREAD_DummyReqHandler, (void*)APP_THREAD_CoapLightsSimpleRequestHandler, NULL};
static otCoapResource OT_Lights_Simple_Ressource = {C_LIGHTS_COMPLEX_RESSOURCE, APP_THREAD_DummyReqHandler, (void*)APP_THREAD_CoapLightsComplexRequestHandler, NULL};
static otCoapResource OT_Border_Time_Ressource = {C_BORER_TIME_RESSOURCE, APP_THREAD_DummyReqHandler, (void*)APP_THREAD_CoapBorderTimeRequestHandler, NULL};
static otCoapResource OT_Toggle_Logging_Ressource = {C_TOGGLE_LOGGING_RESSOURCE, APP_THREAD_DummyReqHandler, (void*)APP_THREAD_CoapToggleLoggingRequestHandler, NULL};

otMessageInfo OT_MessageInfo = {0};
otCoapHeader  OT_Header = {0};
const char borderSyncResource[15] = "borderSync";
const char borderPacket[15] = "borderLog";
const char capTouch[15] = "capTouch";
const char capLoc[15] = "capLoc";

otIp6Address multicastAddr;

//static uint8_t OT_Command = 0;
//static uint16_t OT_BufferIdRead = 1U;
//static uint16_t OT_BufferIdSend = 1U;

static otMessage   * pOT_Message = NULL;
//static otIp6Address   OT_PeerAddress = { .mFields.m8 = { 0 } };

const otMasterKey masterKey = {0x33, 0x33, 0x44, 0x44, 0x33, 0x33, 0x44, 0x44,
		0x33, 0x33, 0x44, 0x44, 0x33, 0x33, 0x44, 0x44};
const otExtendedPanId extendedPanId = {0x11, 0x11, 0x11, 0x11, 0x22, 0x22, 0x22, 0x22};
const char networkName[20] = "PatrickNetwork";

//otIp6Address binary_border_ipv6;
//static char border_ipv6[100] = "fd11:22::994e:6ed7:263d:6187";
//static char border_ipv6[50] = 0x0;

//static char border_ipv6[100] = "FF03::1";
//const char border_ipv6[50] = "fd33:3333:3344:0:0:ff:fe00:e400";
otError   error = OT_ERROR_NONE;
static uint8_t OT_ReceivedCommand = 0;
static char OT_BufferSend[20] = "TEST PAYLOAD";
volatile otIp6Address * myAddress;
volatile otMessageInfo * tempMessageInfo;
volatile uint16_t myRloc16;
volatile otNetifAddress * unicastAddresses;

volatile bool isEnabledIpv6;
//volatile otNetifMulticastAddress * multicastAddresses;
//volatile otIp6Address *  meshLocalEID;
//volatile otIp6Address * linkLocalIPV6;
volatile otMessageInfo * receivedMessage;

struct LogMessage logMessage;
ColorCode lightMessage;
union ColorComplex lightMessageComplex;

struct SystemCal borderRouter = {0};
struct SystemCal receivedSystemCal = {0};

otIp6Address multicastAddr;
/* USER CODE END PV */

/* Functions Definition ------------------------------------------------------*/

void APP_THREAD_Init( void )
{
  /* USER CODE BEGIN APP_THREAD_INIT_1 */

  /* USER CODE END APP_THREAD_INIT_1 */

  SHCI_CmdStatus_t ThreadInitStatus;
  
  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_THREAD_CheckWirelessFirmwareInfo();

#if (CFG_USB_INTERFACE_ENABLE != 0)
  VCP_Init(&VcpTxBuffer[0], &VcpRxBuffer[0]);
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

  /* Register cmdbuffer */
  APP_THREAD_RegisterCmdBuffer(&ThreadOtCmdBuffer);

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_THREAD, UTIL_LPM_DISABLE);

