mitmedialab/Project-Captivate/stm32_mainMCU_Code_v3/STM32_WPAN/App/app_thread.c
    	osMessageQueuePut(lightsSimpleQueueHandle, &lightsSimpleMessage, 0U, 0U);

//    	if(borderRouter.epoch == 0){
//    		APP_THREAD_GetBorderRouterIP();
//    	}else{
//    		APP_THREAD_SendCoapUnicastRequest(NULL, borderRouter.ipv6, borderSyncResource);
//    	}
//    	char message[10] = "garb";;
//    	char ipv6_multicast[15] = "ff03::2";
    	//borderRouter.ipv6 = "fd11:33::6d2f:75a1:d927:9fc5";
    	//char ipv6_multicast[50] = "fd11:33::6d2f:75a1:d927:9fc5";
    	//char ipv6_multicast[50] = "deryfd11:1111:1122:0:22e2:b871:dc02:ad96";

//    	APP_THREAD_SendCoapUnicastRequest(message, borderRouter.ipv6, borderSyncResource);

	}
    receivedMessage = (otMessageInfo *) pMessage;

    if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE)
	{
      APP_THREAD_SendDataResponse(pHeader, pMessageInfo);
	  break;
	}

    if (otCoapHeaderGetType(pHeader) != OT_COAP_TYPE_NON_CONFIRMABLE)
    {
      break;
    }

    if (otCoapHeaderGetCode(pHeader) != OT_COAP_CODE_PUT)
    {
      break;
    }

    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U)
    {
      //APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
    }

    if (OT_ReceivedCommand == 1U)
    {
      //BSP_LED_Toggle(LED1);
    }

  } while (false);
}

// request handler for when receiving a message directed at the data logging resource
static void APP_THREAD_CoapToggleLoggingRequestHandler(otCoapHeader * pHeader,
                                  otMessage            * pMessage,
                                  const otMessageInfo  * pMessageInfo)
{
  do
  {
    //APP_THREAD_SendCoapUnicastRequest();

    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &logMessage, sizeof(logMessage)) == sizeof(logMessage))
	{
    	osMessageQueuePut(togLoggingQueueHandle, &logMessage, 0U, 0U);
//    	//if 0
//    	if(logMessage.status == ENABLE_LOG)
//    	{
//    		osMessageQueuePut(togLoggingQueueHandle, &logMessage, 0U, 0U);
//    	}
//
//    	// if 1
//    	else if (logMessage.status == DISABLE_LOG)
//    	{
//    		osMessageQueuePut(lightsSimpleQueueHandle, &lightsSimpleMessage, 0U, 0U);
//		}
	}

    tempMessageInfo = pMessageInfo;
    receivedMessage = (otMessageInfo *) pMessage;

    if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE)
	{
      APP_THREAD_SendDataResponse(pHeader, pMessageInfo);
	  break;
	}

    if (otCoapHeaderGetType(pHeader) != OT_COAP_TYPE_NON_CONFIRMABLE)
    {
      break;
    }

    if (otCoapHeaderGetCode(pHeader) != OT_COAP_CODE_PUT)
    {
      break;
    }

    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U)
    {
      //APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
    }

    if (OT_ReceivedCommand == 1U)
    {
      //BSP_LED_Toggle(LED1);
    }

  } while (false);
}


volatile char temp_var[100];
volatile uint8_t temp_num = 0;

// request handler for when receiving a message directed at the border router synchronizing resource
static void APP_THREAD_CoapBorderTimeRequestHandler(otCoapHeader * pHeader,
                                  otMessage            * pMessage,
                                  const otMessageInfo  * pMessageInfo)
{
  do
  {
	  //TODO: otMessasgeRead can overwrite the border router IP so probably good to change to a temp variable and then checking if correct before overwritting
	if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &receivedSystemCal, sizeof(receivedSystemCal)) == sizeof(receivedSystemCal))
	{
		// if the message was a put request, copy message over to border router info struct
		if (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_PUT){
			memcpy(&borderRouter, &receivedSystemCal, sizeof(receivedSystemCal));

			// update the onboard RTC unix time
			updateRTC(borderRouter.epoch);
		}

//    	APP_THREAD_SendMyInfo();
	}

    receivedMessage = (otMessageInfo *) pMessage;

    if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_CONFIRMABLE)
	{
      APP_THREAD_SendDataResponse(pHeader, pMessageInfo);
	}

    if (otCoapHeaderGetType(pHeader) == OT_COAP_TYPE_NON_CONFIRMABLE)
    {
    }

    if (otCoapHeaderGetCode(pHeader) == OT_COAP_CODE_GET)
	{
      APP_THREAD_SendMyInfo();
	  break;
	}

//    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_ReceivedCommand, 1U) != 1U)
//    {
//      //APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
//    }

//    if (OT_ReceivedCommand == 1U)
//    {
//      //BSP_LED_Toggle(LED1);
//    }

  } while (false);
}

void updateRTC(time_t now)
{

	RTC_TimeTypeDef sTime;
	RTC_DateTypeDef sDate;

//	struct tm *time_tm = gmtime(register const time_t *timer);
	// https://www.st.com/content/ccc/resource/technical/document/application_note/2a/c2/6f/74/fa/0d/46/3a/CD00015424.pdf/files/CD00015424.pdf/jcr:content/translations/en.CD00015424.pdf
	struct tm *time_tm;
//	taskENTER_CRITICAL();
//	localtime_r(&now, time_tm);
//	taskEXIT_CRITICAL();
//	time_tm = *(localtime(&now));

	RTC_FromEpoch(now, &sTime, &sDate);

//	sTime.Hours = (uint8_t)time_tm->tm_hour;
//	sTime.Minutes = (uint8_t)time_tm->tm_min;
//	sTime.Seconds = (uint8_t)time_tm->tm_sec;
	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK)
	{
	}

//	if (time_tm->tm_wday == 0) { time_tm->tm_wday = 7; } // the chip goes mon tue wed thu fri sat sun
//	sDate.WeekDay = (uint8_t)time_tm->tm_wday;
//	sDate.Month = (uint8_t)time_tm->tm_mon+1; //momth 1- This is why date math is frustrating.
//	sDate.Date = (uint8_t)time_tm->tm_mday;
//	sDate.Year = (uint16_t)(time_tm->tm_year+1900-2000); // time.h is years since 1900, chip is years since 2000

	/*
	* update the RTC
	*/
	if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK)
	{
	}

	HAL_RTCEx_BKUPWrite(&hrtc,RTC_BKP_DR0,0x32F2); // lock it in with the backup registers
}

/**
 * @brief  This function compute the next message to be send
 * @param  None
 * @retval None
 */
//static void APP_THREAD_SendNextBuffer(void)
//{
//  uint16_t j;
//  uint16_t mOffset;
//
//  if (OT_BufferIdSend < 5U)
//  {
//    /* Prepare next buffers to be send */
//    OT_BufferIdSend++;
//    mOffset=(OT_BufferIdSend - 1U) * COAP_PAYLOAD_MAX_LENGTH;
//
//    memset(OT_BufferSend, 0, COAP_PAYLOAD_MAX_LENGTH);
//    for(j = mOffset; j < mOffset + COAP_PAYLOAD_MAX_LENGTH; j++)
//    {
//      OT_BufferSend[j - mOffset] = aDataBuffer[j];
//    }
//
//    /* Send the data in unicast mode */
//    APP_THREAD_SendCoapUnicastRequest();
//  }
//  else
//  {
//    /* Buffer transfer has been successfully  transfered */
//    BSP_LED_On(LED1);
//    APP_DBG(" ********* BUFFER HAS BEEN TRANFERED \r\n");
//  }
//}

static void APP_THREAD_CoapLightsComplexRequestHandler(otCoapHeader * pHeader,
                                  otMessage            * pMessage,
                                  const otMessageInfo  * pMessageInfo)
{
  do
  {
    //APP_THREAD_SendCoapUnicastRequest();

    if (otMessageRead(pMessage, otMessageGetOffset(pMessage), &lightMessageComplex, sizeof(lightMessageComplex)) == sizeof(lightMessageComplex))
	{
    	FrontLightsSet(&lightMessageComplex);
	}

    tempMessageInfo = pMessageInfo;
    receivedMessage = (otMessageInfo *) pMessage;

    if (otCoapHeaderGetType(pHeader) != OT_COAP_TYPE_NON_CONFIRMABLE)
    {
      break;
    }

    if (otCoapHeaderGetCode(pHeader) != OT_COAP_CODE_PUT)
    {
      break;
    }

